using System;
using System.IO;

namespace HW._02
{
    class Program
    {
        static void Main(string[] args)
        {
            
            /*
             1. Чтение файла по заданому пути. 
             2. Считываем весь файл
             3. Загоняем в массив разделяя пробелами 
             4. Создается байтовый массив
             5. В цикле перебирается массив и конвертируется в пиксели
             6. Собирается файл и сохраняется по заданому пути
             ?7. textReader.Dispose() какой-то сборщик мусора, но так и не понял что он дает.
                 Куда его не вставь, всё равно работает, как и без него. 
            */

        }
    }
}
